In [1]:
##YOU CAN ALMOST FIND ALL THE OPERATIONS IN NUMPY

In [ ]:
import numpy as np
import pandas as pd

In [2]:
s1 = pd.Series(np.random.randint(25, size =15), index=list('ABCDEFGHIJMLMNO'))
s1

A    24
B    19
C    14
D    10
E     9
F    15
G     4
H    10
I    21
J     4
M     6
L    21
M     5
N    21
O    14
dtype: int64

In [3]:
s1['M']=100
s1

A     24
B     19
C     14
D     10
E      9
F     15
G      4
H     10
I     21
J      4
M    100
L     21
M    100
N     21
O     14
dtype: int64

In [4]:
df = pd.DataFrame(np.arange(24).reshape((6, 4)), index=['Ohio', 'Colorado', 'California', 'New York', 'Delhi', 'Mumbai'], columns=['one', 'two', 'three', 'four'])
df

            one  two  three  four
Ohio          0    1      2     3
Colorado      4    5      6     7
California    8    9     10    11
New York     12   13     14    15
Delhi        16   17     18    19
Mumbai       20   21     22    23

In [5]:
df['two'] = 50
df

            one  two  three  four
Ohio          0   50      2     3
Colorado      4   50      6     7
California    8   50     10    11
New York     12   50     14    15
Delhi        16   50     18    19
Mumbai       20   50     22    23

In [6]:
df['one'] = np.random.randint(40,size = 6)
df

            one  two  three  four
Ohio         22   50      2     3
Colorado     17   50      6     7
California   25   50     10    11
New York      2   50     14    15
Delhi         5   50     18    19
Mumbai       39   50     22    23

In [7]:
df.loc['delhi'] = -5
df

            one  two  three  four
Ohio         22   50      2     3
Colorado     17   50      6     7
California   25   50     10    11
New York      2   50     14    15
Delhi         5   50     18    19
Mumbai       39   50     22    23
delhi        -5   -5     -5    -5

In [8]:
df[['one','two']]= 33
df

            one  two  three  four
Ohio         33   33      2     3
Colorado     33   33      6     7
California   33   33     10    11
New York     33   33     14    15
Delhi        33   33     18    19
Mumbai       33   33     22    23
delhi        33   33     -5    -5

In [10]:
df.loc[df['one'] > 40]

Empty DataFrame
Columns: [one, two, three, four]
Index: []

In [11]:
#arthematic operations
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [12]:
s1+s2  #it is showing NaN because the element is not found which is simillar to the index present in the both of s1 and s2 series.

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [13]:
s3 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'b', 'c', 'd'])
s4 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['e', 'f', 'g', 'h', 'i'])
s3 + s4

a   NaN
b   NaN
c   NaN
d   NaN
e   NaN
f   NaN
g   NaN
h   NaN
i   NaN
dtype: float64

In [14]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'), index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'), index=['Newyork', 'Ohio', 'Texas', 'California'])
df1 + df2       #simillar to the series operation, which gives us NaN

              b   c     d   e
California  NaN NaN   NaN NaN
Colorado    NaN NaN   NaN NaN
Newyork     NaN NaN   NaN NaN
Ohio        3.0 NaN   6.0 NaN
Texas       9.0 NaN  12.0 NaN

In [15]:
s1 = pd.Series(np.random.randint(25, size=15), index=list('EOPTDKEOXNPGCJW'))
s1

E    16
O    12
P    16
T    17
D     4
K    17
E    13
O    14
X    15
N    21
P    13
G     8
C    18
J    21
W    22
dtype: int64

In [16]:
s1.sort_index()  #helps in sorting them in alphabetical order.

C    18
D     4
E    16
E    13
G     8
J    21
K    17
N    21
O    12
O    14
P    16
P    13
T    17
W    22
X    15
dtype: int64

In [17]:
s1.sort_values() #sort values

D     4
G     8
O    12
E    13
P    13
O    14
X    15
E    16
P    16
T    17
K    17
C    18
N    21
J    21
W    22
dtype: int64

In [24]:
df3 = pd.DataFrame(np.random.randint(50, size=(6, 4)), index=list('DEOPAX'), columns=['ramesh', 'suresh', 'Geeta', 'Seeta'])
df3

   ramesh  suresh  Geeta  Seeta
D      48      34     17     33
E       2      22     43     35
O      34       6      1      1
P      17      32      8     13
A      11      32     31     36
X      44      32      8      0

In [25]:
df3.sort_values

<bound method DataFrame.sort_values of    ramesh  suresh  Geeta  Seeta
D      48      34     17     33
E       2      22     43     35
O      34       6      1      1
P      17      32      8     13
A      11      32     31     36
X      44      32      8      0>

In [27]:
df3.sort_values('Seeta') #simillar to series

   ramesh  suresh  Geeta  Seeta
X      44      32      8      0
O      34       6      1      1
P      17      32      8     13
D      48      34     17     33
E       2      22     43     35
A      11      32     31     36

In [28]:
s1.unique() #finds the only unique elements

array([16, 12, 17,  4, 13, 14, 15, 21,  8, 18, 22])